Revit 2024 API
Tile.TileBrickType Property
 The property labeled "Type" from the "Tile" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string TileBrickType { get; }
Visual Basic
Public Shared ReadOnly Property TileBrickType As String
	Get
Visual C++
public:
static property String^ TileBrickType {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "TileBrickType".
See Also
Tile Class
Autodesk.Revit.DB.Visual Namespace